<details ><summary>plan for ruby-getting-started-terraform 2026-01-01 09:03:13 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_role_policy.rds_s3_export will be updated in-place
  ~ resource "aws_iam_role_policy" "rds_s3_export" {
        id     = "ruby-getting-started-rds-s3-export-role:ruby-getting-started-rds-s3-export-policy"
        name   = "ruby-getting-started-rds-s3-export-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:ListBucket",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::ruby-getting-started-rds-backup-20251230",
                          - "arn:aws:s3:::ruby-getting-started-rds-backup-20251230/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_kms_alias.rds_s3_export will be created
  + resource "aws_kms_alias" "rds_s3_export" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/ruby-getting-started-rds-s3-export"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.rds_s3_export will be created
  + resource "aws_kms_key" "rds_s3_export" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 10
      + description                        = "KMS key for RDS S3 export encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags                               = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-s3-export-key"
          + "Project"     = "ruby-getting-started"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "Name"        = "ruby-getting-started-rds-s3-export-key"
          + "Project"     = "ruby-getting-started"
        }
    }

  # aws_kms_key_policy.rds_s3_export will be created
  + resource "aws_kms_key_policy" "rds_s3_export" {
      + bypass_policy_lockout_safety_check = false
      + id                                 = (known after apply)
      + key_id                             = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::786832920677:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                          + "kms:CreateGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "export.rds.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow RDS to use the key"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:GenerateDataKey",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow S3 to use the key"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (ruby-getting-started-terraform)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |              RESOURCE               |
|--------|-------------------------------------|
| add    | `aws_kms_alias.rds_s3_export`       |
|        | `aws_kms_key.rds_s3_export`         |
|        | `aws_kms_key_policy.rds_s3_export`  |
| update | `aws_iam_role_policy.rds_s3_export` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p ruby-getting-started-terraform
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>